app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
---
  def index
    render json: Reservation.all

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Reservation.all.find_by_id(params[:id])

INSERT INTO "reservations" ("user_id", "restaurant_id", "time_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["restaurant_id", 1], ["time_date", "2018-12-14"], ["created_at", "2018-12-05 19:14:01.488316"], ["updated_at", "2018-12-05 19:14:01.488316"]]
---
  def create
    render json: Reservation.create(reservation_params)