app/controllers/restaurants_controller.rb

  def index
    render json: Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def show
    render json: Restaurant.all.find_by_id(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]