app/controllers/users_controller.rb

  def show
    render json: User.all.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def find_user_by_name
    name = params[:name].split('_').join(' ')
    # byebug
    render json: User.all.find_by(name: name)
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Will_Smith"], ["LIMIT", 1]]